Revit 2027 API
MetallicpaintTopcoatType Enumeration
 The enumerated type representing the permitted values for the asset property "MetallicpaintTopcoat" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MetallicpaintTopcoatType
Public Enumeration MetallicpaintTopcoatType
public enum class MetallicpaintTopcoatType
type MetallicpaintTopcoatType
Members
Member name | Value | Description
Carpaint | 0
Chrome | 1
Custom | 3
Matte | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace